_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_25 (Flatten)         (None, 10304)             0         
_________________________________________________________________
dense_73 (Dense)             (None, 127)               1308735   
_________________________________________________________________
dense_74 (Dense)             (None, 127)               16256     
_________________________________________________________________
dense_75 (Dense)             (None, 40)                5120      
=================================================================
Total params: 1,330,111
Trainable params: 1,330,111
Non-trainable params: 0
_________________________________________________________________
