_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_77 (Flatten)         (None, 10304)             0         
_________________________________________________________________
dense_153 (Dense)            (None, 235)               2421675   
_________________________________________________________________
dense_154 (Dense)            (None, 40)                9440      
=================================================================
Total params: 2,431,115
Trainable params: 2,431,115
Non-trainable params: 0
_________________________________________________________________
