_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten_1 (Flatten)          (None, 10304)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 125)               1288125   
_________________________________________________________________
dense_2 (Dense)              (None, 40)                5040      
=================================================================
Total params: 1,293,165
Trainable params: 1,293,165
Non-trainable params: 0
_________________________________________________________________
